import PageWrapper from "@/components/wrapper/page-wrapper";
import React from "react";

const privacy_policy = `سیاست حفظ حریم خصوصی

میخک متعهد به حفظ حریم خصوصی اطلاعات شخصی شما است. ما اطلاعات شما را با بالاترین سطح امنیت محافظت می‌کنیم و از آن تنها برای اهداف مشخص شده در این سیاست استفاده خواهیم کرد.

اطلاعاتی که از شما جمع‌آوری می‌کنیم:

اطلاعات شخصی: نام کامل، شماره تماس، آدرس ایمیل، کد ملی (در صورت نیاز به احراز هویت)، تاریخ تولد و سایر اطلاعاتی که شما در هنگام ثبت‌نام یا استفاده از برنامه ارائه می‌دهید.

علت استفاده از اطلاعات شما:

ارائه خدمات: اطلاعات شما برای ارائه خدمات مورد نظر به شما، مانند ثبت‌نام، احراز هویت، و دسترسی به ویژگی‌های مختلف برنامه استفاده می‌شود.
ارتباط با شما: از اطلاعات تماس شما برای ارسال اطلاعیه‌ها، پاسخ به سوالات و ارائه پشتیبانی استفاده می‌شود.
بهبود تجربه کاربری: اطلاعات شما برای بهبود عملکرد برنامه، شخصی‌سازی تجربه کاربری، و توسعه ویژگی‌های جدید مورد استفاده قرار می‌گیرد.
تحلیل داده‌ها: اطلاعات جمع‌آوری شده به صورت کلی و ناشناس برای تحلیل روندهای استفاده از برنامه و بهبود خدمات ما مورد استفاده قرار می‌گیرد.
حفاظت از اطلاعات شما:

امنیت داده‌ها: ما از اقدامات امنیتی فنی و مدیریتی قوی برای محافظت از اطلاعات شما در برابر دسترسی، افشا، تغییر یا تخریب غیرمجاز استفاده می‌کنیم.
عدم اشتراک‌گذاری اطلاعات: اطلاعات شخصی شما به هیچ شخص یا سازمان ثالثی فروخته، اجاره داده یا منتقل نمی‌شود، مگر اینکه با رضایت شما یا به دلایل قانونی الزامی باشد.
شفافیت: ما به شما حق دسترسی، اصلاح و حذف اطلاعات شخصی خود را می‌دهیم.
تغییرات در سیاست حفظ حریم خصوصی:

ما ممکن است این سیاست را به‌روزرسانی کنیم. هرگونه تغییر در این سیاست در همین صفحه منتشر خواهد شد و تاریخ آخرین به‌روزرسانی در پایین صفحه ذکر خواهد شد.

تماس با ما:

در صورت داشتن هرگونه سوال یا نگرانی در مورد این سیاست، لطفا با ما تماس بگیرید.

admin@mikhakdental.com

با تشکر از شما برای اعتماد به میخک`;

export default function Page() {
  return (
    <PageWrapper pageTitle="قوانین و مقررات">
      <div className="py-4">
        <div className="whitespace-pre-wrap text-base">{privacy_policy}</div>
      </div>
    </PageWrapper>
  );
}
