const ErrorMessages: { [key: string]: any } = {
  200: "عملیات با موفقیت انجام شد.",
  400: "درخواست شما نادرست است. لطفاً ورودی‌های خود را بررسی کنید.",
  401: "دسترسی به این صفحه نیاز به ورود دارد. لطفاً وارد حساب کاربری خود شوید.",
  403: "شما مجاز به دسترسی به این صفحه نیستید.",
  404: "متأسفانه صفحه‌ای که به دنبال آن بودید، موجود نیست.",
  405: "درخواست شما با روش نادرست ارسال شده است. لطفاً روش دیگری را امتحان کنید.",
  408: "زمان درخواست شما به پایان رسید. لطفاً دوباره تلاش کنید.",
  500: "خطایی در سرور رخ داده است. تیم فنی ما در حال بررسی است.",
  502: "خطایی در سرور رخ داده است. تیم فنی ما در حال بررسی است.",
  503: "سرویس موقتاً در دسترس نیست. لطفاً بعداً تلاش کنید.",
  504: "خطایی در سرور رخ داده است. تیم فنی ما در حال بررسی است.",
  username: {
    notValid: "نام کاربری باید ایمیل یا شماره موبایل معتبر باشد.",
  },
  phone: {
    notValid: "شماره موبایل وارد شده معتبر نمی‌باشد",
    required: "شماره موبایل الزامی می‌باشد",
  },
  email: {
    notValid: "ایمیل وارد شده معتبر نمی‌باشد",
    required: "ایمیل الزامی می‌باشد",
  },
  firstname: {
    required: "نام الزامی می‌باشد",
  },
  lastname: {
    required: "نام خانوادگی الزامی می‌باشد",
  },
  nationalCode: {
    required: "کدملی الزامی می‌باشد",
  },
  birthday: {
    required: "تاریخ تولد الزامی می‌باشد",
  },
  otp: "کد وارد شده معتبر نیست",
};

export default ErrorMessages;
